html/20231215T055647--deploy-django-app__django_python.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>deploy django app</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">16 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231215T055647--deploy-django-app__django_python.html">deploy django app</a></h1>
<p>
If deploying with nginx, make sure to do server<sub>tokens</sub> = off (<a href="https://www.youtube.com/watch?v=-1xPfxtt0SY&amp;ab_channel=AndreyIvanov%7CPython">why is here</a>).
Mask response header so hackers wouldn't know your server and version of it.
</p>

<p>
Don't be opening random ports!! dont increase ways to attack your
server.
</p>

<p>
CLOSE ADMIN PANEL to everyone except me!!!!
</p>

<ul class="org-ul">
<li><p>
preview local deployment on your phone localhost
</p>
<div class="org-src-container">
<pre class="src src-bash"># be connected to the same wifi!!!
# add the local ip to allowed hosts
# ALLOWED_HOSTS = ["192.168.1.177"]
python manage.py runserver 192.168.1.177:8000
</pre>
</div></li>

<li><a href="https://mattsegal.dev/simple-django-deployment.html">digitalocean tutorial</a></li>
<li><a href="https://github.com/batpad/railways">django project about Indian trains - just for reference</a></li>
<li><a href="https://tutorial.djangogirls.org/en/deploy/">deploy with pythonanywhere</a></li>
<li>dennis have tutorial also</li>
<li>psycopg2 for postgresql db</li>
<li>whitenoise for images</li>
<li>railway quick deployment</li>
<li>csfr token for apps(including django admin) (CSRF<sub>TRUSTED</sub><sub>ORIGINS</sub>)</li>
<li>pythonanywhere for quick deployment</li>
<li><a href="https://tutorial.djangogirls.org/en/deploy/">djangogirls turorial how to launch and deploy</a></li>
<li>digitalocean production proper do everything yourself solution
komandos ir pan</li>
<li>GUI for sqlite browser in local app - "DB browser for sqlite" super
fun pazaist ir parasyt queries paciam</li>
<li>dont need to push db file</li>
<li>runtime.txt</li>
<li>requiremenets.txt</li>
<li>allowed hosts</li>
<li>pillow for images</li>
<li><p>
change db in settings.py
DATABASES = {
  "default": {
      "ENGINE": "django.db.backends.sqlite3",
      "NAME": BASE<sub>DIR</sub> / "db.sqlite3",
</p>

<p>
     'ENGINE': 'django.db.backends.postgresql',
     'NAME': 'railway',
     'USER': 'postgres',
     'PASSWORD': 'gT0TDKJM2K5N6F9QAkqi',
     'HOST': 'containers-us-west-105.railway.app',
     'PORT': '8014',
 }
}
</p></li>
<li>specify collecstatic location in settings.py</li>
<li>PYTHON DECOUPLING
for hiding variables store parameters in ini or .
env files; define comprehensive default values; properly convert
values to the correct data type; have only one configuration module
to rule all your instances.</li>
<li><a href="https://help.pythonanywhere.com/pages/environment-variables-for-web-apps">How to set environment variables for your web apps (for SECRET<sub>KEY</sub> etc)</a></li>
<li><a href="https://djangostars.com/blog/configuring-django-settings-best-practices/">Configuring Django Settings: Best Practices</a></li>
<li>can deploy on raspberry pi</li>
<li>Why do some people use AWS for their media files?</li>
<li><a href="https://www.reddit.com/r/django/comments/sr21h2/comment/hwtgrpb/">labai gera diskusija on reddit cia zmogus klausineja apie security dalykus</a></li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-django.html">django</a> <a href="https://arvydasg.github.io/devnotes/html/tag-python.html">python</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
